# vim:ft=Brewfile

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'bufbuild/buf'
tap 'git-duet/tap'
tap 'universal-ctags/universal-ctags'
tap 'cloudfoundry/tap'
tap 'vapor/homebrew-tap'
tap 'kylef/formulae'
tap 'phogolabs/tap'
tap 'golangci/tap'
tap 'mongodb/brew'

cask 'unity'
cask 'ngrok'
cask 'appcleaner'
cask 'alacritty'
cask 'zoomus'
cask 'backblaze'
cask 'viscosity'
cask 'qbittorrent'
cask 'free-ruler'
cask 'google-chrome'
cask 'sizeup'
cask 'skype'
cask 'vagrant'
cask '1password'
cask 'java'
cask 'transmit'
cask 'alfred'
cask 'fliqlo'
cask 'slack'
cask 'spotify'
cask 'dotnet-sdk'
cask 'viber'
cask 'whatsapp'
cask 'istat-menus'
cask 'vlc'
cask 'tomighty'
cask 'adobe-acrobat-reader'
cask 'adobe-digital-editions'
cask 'visual-studio-code'
cask 'xquartz'
cask 'macdown'
cask 'intellij-idea-ce'
cask 'harvest'
cask 'robo-3t'
cask 'postico'
cask 'telegram'
cask 'duet'
cask 'grammarly'
cask 'powershell'
cask 'font-dejavusansmono-nerd-font'
cask 'google-cloud-sdk'
cask 'kafka-tool'
cask 'adoptopenjdk8'

brew 'irssi'
brew 'hugo'
brew 'ack'
brew 'bash'
brew 'ruby'
brew 'chruby'
brew 'coreutils'
brew 'hyperkit'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'freetype'
brew 'mercurial'
brew 'git'
brew 'git-duet'
brew 'git-flow'
brew 'go'
brew 'golangci-lint'
brew 'rustup-init'
brew 'kotlin'
brew 'ctop'
brew 'htop'
brew 'jq'
brew 'lastpass-cli'
brew 'libyaml'
brew 'lua'
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'zlib'
brew 's3cmd'
brew 'awscli'
brew 'swiftenv'
brew 'vapor'
brew 'swiftlint'
brew 'nvm'
brew 'yarn'
brew 'tig'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'vim'
brew 'neovim'
brew 'watch'
brew 'wget'
brew 'pstree'
brew 'pwgen'
brew 'cf-cli'
brew 'aria2'
brew 'ipcalc'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'universal-ctags', args: ['HEAD']
brew 'youtube-dl'
brew 'bash-completion'
brew 'ansible'
brew 'vnstat'
brew 'kubernetes-cli'
brew 'ffmpeg'
brew 'atomicparsley'
brew 'unrar'
brew 'redis'
brew 'postgresql'
brew 'pgcli'
brew 'rabbitmq'
brew 'sfk'
brew 'nmap'
brew 'asciinema'
brew 'gradle'
brew 'graphviz'
brew 'maven'
brew 'vault-cli'
brew 'paket'
brew 'kops'
brew 'fzf'
brew 'fd'
brew 'httpie'
brew 'sourcekitten'
brew 'urlview'
brew 'gpg'
brew 'pandoc'
brew 'ranger'
brew 'highlight'
brew 'fpp'
brew 'terraform'
brew 'packer'
brew 'parcello'
brew 'prana'
brew 'stride'
brew 'tsung'
brew 'leiningen'
brew 'gnu-sed'
brew 'cfssl'
brew 'ghr'
brew 'minikube'
brew 'starship'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'protoc-gen-go-grpc'
brew 'buf'
brew 'grpc'
brew 'grpcurl'
brew 'gatsby-cli'
brew 'autorest'
brew 'typescript'
brew 'dnsmasq'
brew 'krew'
brew 'mkcert'
brew 'nss'
brew 'clang-format'
brew 'ripgrep'
