tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'homebrew/completions'
tap 'homebrew/services'
tap 'git-duet/tap'
tap 'universal-ctags/universal-ctags'
tap 'cloudfoundry/tap'
tap 'drone/drone'

brew 'irssi'
brew 'drone', args: ['devel']
brew 'heroku'
brew 'hugo'
brew 'ack'
brew 'awscli'
brew 'bash'
brew 'chruby'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'docker-machine'
brew 'emacs', args: ['with-cocoa']
brew 'freetype'
brew 'mercurial'
brew 'git'
brew 'git-duet'
brew 'git-flow'
brew 'go'
brew 'kotlin'
brew 'caddy'
brew 'htop'
brew 'jq'
brew 'lastpass-cli'
brew 'libyaml'
brew 'lua'
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'ruby-install'
brew 'python3'
brew 's3cmd'
brew 'npm'
brew 'yarn'
brew 'tig'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'vim', args: ['with-lua','with-python']
brew 'neovim'
brew 'watch'
brew 'wget'
brew 'pstree'
brew 'pwgen'
brew 'cf-cli'
brew 'aria2'
brew 'ipcalc'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'universal-ctags', args: ['HEAD']
brew 'youtube-dl'
brew 'bash-completion'
brew 'ansible'
brew 'vnstat'
brew 'kubernetes-cli'
brew 'ffmpeg'
brew 'atomicparsley'
brew 'unrar'
brew 'redis'
brew 'mongodb'
brew 'postgresql'
brew 'rabbitmq'
brew 'elasticsearch'
brew 'sfk'
brew 'nmap'
brew 'typescript'
brew 'asciinema'
brew 'gradle'
brew 'graphviz'

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'screenhero'
cask 'sizeup'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask '1password'
cask 'dropbox'
cask 'dash'
cask 'java'
cask 'transmit'
cask 'alfred'
cask 'appcleaner'
cask 'fliqlo'
cask 'font-fira-mono-for-powerline'
cask 'font-meslo-lg-for-powerline'
cask 'slack'
cask 'spotify'
cask 'dotnet'
cask 'dotnet-sdk'
cask 'firefoxdeveloperedition'
cask 'viber'
cask 'whatsapp'
cask 'minikube'
cask 'istat-menus'
cask 'utorrent'
cask 'vlc'
cask 'caffeine'
cask 'tomighty'
cask 'adobe-reader'
cask 'visual-studio-code'
cask 'xquartz'
cask 'gimp'
cask 'inkscape'
cask 'macdown'
cask 'appcleaner'
cask 'intellij-idea-ce'
cask 'kodi'
cask 'android-studio'
cask 'genymotion'
cask 'valentina-studio'
cask 'harvest'
cask 'robomongo'
cask 'caffeine'
cask 'flux'
cask 'telegram'
cask 'duet'
cask 'Postico'
