# vim:ft=Brewfile

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'homebrew/completions'
tap 'homebrew/services'
tap 'homebrew/science'
tap 'git-duet/tap'
tap 'universal-ctags/universal-ctags'
tap 'cloudfoundry/tap'
tap 'vapor/homebrew-tap'

cask 'karabiner-elements'
cask 'vivaldi'
cask 'free-ruler'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iterm2'
cask 'screenhero'
cask 'sizeup'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask '1password'
cask 'dropbox'
cask 'dash'
cask 'java'
cask 'java8'
cask 'transmit'
cask 'alfred'
cask 'appcleaner'
cask 'fliqlo'
cask 'font-fira-mono-for-powerline'
cask 'font-meslo-lg-for-powerline'
cask 'font-hack-nerd-font'
cask 'slack'
cask 'spotify'
cask 'dotnet'
cask 'dotnet-sdk'
cask 'firefoxdeveloperedition'
cask 'viber'
cask 'whatsapp'
cask 'minikube'
cask 'istat-menus'
cask 'utorrent'
cask 'vlc'
cask 'caffeine'
cask 'tomighty'
cask 'adobe-reader'
cask 'visual-studio-code'
cask 'xquartz'
cask 'gimp'
cask 'macdown'
cask 'appcleaner'
cask 'intellij-idea-ce'
cask 'rider'
cask 'kodi'
cask 'android-studio'
cask 'genymotion'
cask 'harvest'
cask 'robomongo'
cask 'postico'
cask 'caffeine'
cask 'flux'
cask 'telegram'
cask 'duet'
cask 'onedrive'
cask 'grammarly'
cask 'twist'

brew 'irssi'
brew 'hugo'
brew 'ack'
brew 'bash'
brew 'chruby'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'docker-machine'
brew 'freetype'
brew 'mercurial'
brew 'git'
brew 'git-duet'
brew 'git-flow'
brew 'go'
brew 'rustup-init'
brew 'kotlin'
brew 'caddy'
brew 'ctop'
brew 'htop'
brew 'jq'
brew 'lastpass-cli'
brew 'libyaml'
brew 'lua'
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'ruby-install'
brew 'zlib'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 's3cmd'
brew 'awscli'
brew 'svett/formulae/swiftenv'
brew 'vapor'
brew 'swiftlint'
brew 'nvm'
brew 'yarn', args: ['without-node']
brew 'tig'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-python', 'with-python3']
brew 'neovim'
brew 'watch'
brew 'wget'
brew 'pstree'
brew 'pwgen'
brew 'cf-cli'
brew 'aria2'
brew 'ipcalc'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'universal-ctags', args: ['HEAD']
brew 'youtube-dl'
brew 'bash-completion'
brew 'ansible'
brew 'vnstat'
brew 'kubernetes-cli'
brew 'ffmpeg'
brew 'atomicparsley'
brew 'unrar'
brew 'redis'
brew 'mongodb'
brew 'postgresql'
brew 'pldebugger'
brew 'pgcli'
brew 'rabbitmq'
brew 'elasticsearch'
brew 'sfk'
brew 'nmap'
brew 'asciinema'
brew 'gradle'
brew 'graphviz'
brew 'maven'
brew 'r'
brew 'vault-cli'
brew 'paket', args: ['without-mono']
brew 'kops'
brew 'fzf'
brew 'fd'
brew 'httpie'
brew 'sourcekitten'
brew 'urlview'
brew 'gpg'
brew 'pandoc'
brew 'ranger'
brew 'highlight'
brew 'fpp'
brew 'openvpn'
brew 'terraform'
brew 'packer'
